generating-polyominos.org
#+title: Generating polyominos for exact covering
#+OPTIONS: num:nil
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="org-overrides.css" />

* Generating polyominos.

At the office, someone gave a challenge asking how many ways to tile a
$16\times16$ grid with $8$ cell polyominos.  I remembered this was
straight out of several of Knuth's exercises, so thought I would try
my hand.

First catch, oddly, was that I didn't know how to generate all
polyominos of the desired size.  From my limited reading online, this
is itself a challenge.  I just wanted to have the values to plug in to
DLX.

* Approach I'm taking.

I finally somewhat understood a crappy way of generating the pieces if
I treated them as a collection of active coordinates.  In that world,
to create all polyominos of one more degree up, I just take each
active coordinate and add up/right/down/left to a list of candidates
coordinates to try.  (With some caveats I'll discuss as I get to
them.)

* Coordinates

I had originally thought I would play with some of the CLOS methods to
provide my coordinate class.  I had actually built up some things
using it, but I had to acknowledge that `defstruct` is more inline
with what I need/want.  So, yeah, I use a basic struct for a
coordinate.

Here is the definition with three sample methods to create/copy one.

#+begin_src lisp 
  (defstruct coordinate (x 0 :read-only t) (y 0 :read-only t))

  (defun left (coordinate)
    (with-slots (x y) coordinate
      (make-coordinate :x x :y (- y 1))))
  (defun right (coordinate)
    (with-slots (x y) coordinate
      (make-coordinate :x x :y (+ y 1))))
  (defun up (coordinate)
    (with-slots (x y) coordinate
      (make-coordinate :x (- x 1) :y y)))
  (defun down (coordinate)
    (with-slots (x y) coordinate
      (make-coordinate :x (+ x 1) :y y)))
#+end_src

#+RESULTS:
: DOWN

And, just to show how to use this, here are some helper methods.

#+begin_src lisp :exports both
  (format nil "狺" 
          (list (make-coordinate :x 1)
                #s(coordinate :x 0 :y 12)
                (copy-coordinate #s(coordinate :x 3 :y 3))
                (up #s(coordinate :x 0 :y 0))
                (down #s(coordinate :x 0 :y 0))
                (left #s(coordinate :x 0 :y 0))
                (right #s(coordinate :x 0 :y 0))))
#+end_src

#+RESULTS:
: #S(COORDINATE :X 1 :Y 0)
: #S(COORDINATE :X 0 :Y 12)
: #S(COORDINATE :X 3 :Y 3)
: #S(COORDINATE :X -1 :Y 0)
: #S(COORDINATE :X 1 :Y 0)
: #S(COORDINATE :X 0 :Y -1)
: #S(COORDINATE :X 0 :Y 1)

