generating-polyominos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-05 Fri 20:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Generating polyominos for exact covering</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Josh Berry" />
<link rel="stylesheet" type="text/css" href="org-overrides.css" />
</head>
<body>
<div id="content">
<h1 class="title">Generating polyominos for exact covering</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd013593">Generating polyominos.</a></li>
<li><a href="#org8f5a0b9">Approach I'm taking.</a></li>
<li><a href="#org5b4ead9">Coordinates</a></li>
<li><a href="#orgc5f015e">But I really want a polyomino representation.</a></li>
<li><a href="#org0888cb0">Now, let's generate some polyominos.</a></li>
<li><a href="#orgd6fa03e">A brief diversion</a></li>
<li><a href="#orgd2adcc3">Of course, I really need something else.</a></li>
<li><a href="#org7118b57">Generating the header row</a></li>
<li><a href="#orge1fa39b">Generating a placement of a piece everywhere it fits</a></li>
<li><a href="#org7272614">Bringing them together</a></li>
<li><a href="#org3e496f8">Afterward</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd013593" class="outline-2">
<h2 id="orgd013593">Generating polyominos.</h2>
<div class="outline-text-2" id="text-orgd013593">
<p>
At the office, someone gave a challenge asking how many ways to tile a
\(16\times16\) grid with \(8\) cell polyominos.  I remembered this was
straight out of several of Knuth's exercises, so thought I would try
my hand.
</p>

<p>
First catch, oddly, was that I didn't know how to generate all
polyominos of the desired size.  From my limited reading online, this
is itself a challenge.  I just wanted to have the values to plug in to
DLX.
</p>
</div>
</div>

<div id="outline-container-org8f5a0b9" class="outline-2">
<h2 id="org8f5a0b9">Approach I'm taking.</h2>
<div class="outline-text-2" id="text-org8f5a0b9">
<p>
I finally somewhat understood a crappy way of generating the pieces if
I treated them as a collection of active coordinates.  In that world,
to create all polyominos of one more degree up, I just take each
active coordinate and add up/right/down/left to a list of candidates
coordinates to try.  (With some caveats I'll discuss as I get to
them.)
</p>
</div>
</div>

<div id="outline-container-org5b4ead9" class="outline-2">
<h2 id="org5b4ead9">Coordinates</h2>
<div class="outline-text-2" id="text-org5b4ead9">
<p>
I had originally thought I would play with some of the CLOS methods to
provide my coordinate class.  I had actually built up some things
using it, but I had to acknowledge that `defstruct` is more inline
with what I need/want.  So, yeah, I use a basic struct for a
coordinate.
</p>

<p>
Here is the definition with three sample methods to create/copy one.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defstruct</span> <span style="color: #2492db;">coordinate</span> (x 0 <span style="color: #16a085;">:read-only</span> t) (y 0 <span style="color: #16a085;">:read-only</span> t))

(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">left</span> (coordinate)
  (<span style="color: #d98c10;">with-slots</span> (x y) coordinate
    (make-coordinate <span style="color: #16a085;">:x</span> x <span style="color: #16a085;">:y</span> (- y 1))))
(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">right</span> (coordinate)
  (<span style="color: #d98c10;">with-slots</span> (x y) coordinate
    (make-coordinate <span style="color: #16a085;">:x</span> x <span style="color: #16a085;">:y</span> (+ y 1))))
(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">up</span> (coordinate)
  (<span style="color: #d98c10;">with-slots</span> (x y) coordinate
    (make-coordinate <span style="color: #16a085;">:x</span> (- x 1) <span style="color: #16a085;">:y</span> y)))
(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">down</span> (coordinate)
  (<span style="color: #d98c10;">with-slots</span> (x y) coordinate
    (make-coordinate <span style="color: #16a085;">:x</span> (+ x 1) <span style="color: #16a085;">:y</span> y)))
</pre>
</div>

<p>
And, just to show how to use this, here are some helper methods.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(format nil <span style="color: #0a74b9;">"狺"</span> 
        (list (make-coordinate <span style="color: #16a085;">:x</span> 1)
              #s(coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 12)
              (copy-coordinate #s(coordinate <span style="color: #16a085;">:x</span> 3 <span style="color: #16a085;">:y</span> 3))
              (up #s(coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0))
              (down #s(coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0))
              (left #s(coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0))
              (right #s(coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0))))
</pre>
</div>

<pre class="example">
#S(COORDINATE :X 1 :Y 0)
#S(COORDINATE :X 0 :Y 12)
#S(COORDINATE :X 3 :Y 3)
#S(COORDINATE :X -1 :Y 0)
#S(COORDINATE :X 1 :Y 0)
#S(COORDINATE :X 0 :Y -1)
#S(COORDINATE :X 0 :Y 1)
</pre>
</div>
</div>
