generating-polyominos.org
* But I really want a polyomino representation.

Basic structure for a polyomino isn't that tough, just a list of
coordinates.  I just need a helper method to make sure and only add
unique coordinates to one.  (I don't have a sanity check to make sure
it is a legal coordinate to add, though I don't think that would be
tough here.)

#+begin_src lisp
  (defstruct polyomino (active-coordinates nil :read-only t))

  (defun polyomino-degree (polyomino)
    (length (slot-value polyomino 'active-coordinates)))

  (defun polyomino-add-coordinate (polyomino coordinate)
    (make-polyomino :active-coordinates (adjoin coordinate (slot-value polyomino 'active-coordinates) :test #'equalp)))

  (defun polyomino-has-coordinate (polyomino coordinate)
    (member coordinate (slot-value polyomino 'active-coordinates) :test #'equalp))
#+end_src

#+RESULTS:
: POLYOMINO-HAS-COORDINATE

Of course, just printing an instance of this is not that helpful.  Not
worthless, since you can see the coordinates in a polyomino; just not
entirely helpful.

#+begin_src lisp :exports both
  (let* ((a (make-polyomino))
         (b (make-polyomino :active-coordinates (list (make-coordinate))))
         (c (polyomino-add-coordinate a (make-coordinate :x 0 :y 0)))
         (d (polyomino-add-coordinate c (make-coordinate :x 0 :y 0)))
         (e (polyomino-add-coordinate d (make-coordinate :x 0 :y 1))))
    (list a b c d e))
#+end_src

#+RESULTS:
: (#S(POLYOMINO :ACTIVE-COORDINATES NIL)
:  #S(POLYOMINO :ACTIVE-COORDINATES (#S(COORDINATE :X 0 :Y 0)))
:  #S(POLYOMINO :ACTIVE-COORDINATES (#S(COORDINATE :X 0 :Y 0)))
:  #S(POLYOMINO :ACTIVE-COORDINATES (#S(COORDINATE :X 0 :Y 0)))
:  #S(POLYOMINO
:     :ACTIVE-COORDINATES (#S(COORDINATE :X 0 :Y 1) #S(COORDINATE :X 0 :Y 0))))

That said, lets make something that will do that for us.  My FORMAT
skills are less than worth talking about, but it turns out this isn't
that tough.

#+begin_src lisp :exports both 
  (defun polyomino-to-string (polyomino)
    (let ((width (polyomino-degree polyomino))
          (height (polyomino-degree polyomino)))
      (format nil "狺"
              (loop for i from 0 below height
                 collect (loop for j from 0 below width
                            collect (if (polyomino-has-coordinate polyomino (make-coordinate :x i :y j))
                                        "X"
                                        "-"))))))

  (let* ((a (make-coordinate))
         (b (down a))
         (c (down b))
         (d (right b))
         (p (make-polyomino :active-coordinates (list a b c d))))
    (polyomino-to-string p))
#+end_src

#+RESULTS:
: X---
: XX--
: X---
: ----

That looks almost like what I want.  Printing about 4 spaces by 4
spaces and letting me see things.  However, it has an obvious flaw,
demonstrated by:

#+begin_src lisp :exports both
  (let* ((a (make-coordinate))
         (b (up a))
         (c (up b))
         (d (left b))
         (p (make-polyomino :active-coordinates (list a b c d))))
    (polyomino-to-string p))
#+end_src

#+RESULTS:
: X---
: ----
: ----
: ----

This would also prevent me from seeing that two identical shapes were
identical, which is annoying.  Luckily, not tough.  Just need to
normalize us to the origin.  (This was fun to work out on paper.)

#+begin_src lisp :exports both
  (defun polyomino-normalize (polyomino)
    (loop for coordinate in (slot-value polyomino 'active-coordinates)
       minimizing (slot-value coordinate 'x) into min-x
       minimizing (slot-value coordinate 'y) into min-y
       finally (return (make-polyomino :active-coordinates
                                       (sort (loop for coordinate in (slot-value polyomino 'active-coordinates)
                                                collect (with-slots (x y) coordinate
                                                          (make-coordinate :x (- x min-x)
                                                                           :y (- y min-y))))
                                             (lambda (a b)
                                               (with-slots ((ax x) (ay y)) a
                                                 (with-slots ((bx x) (by y)) b
                                                   (< (+ (* ax (polyomino-degree polyomino))
                                                         ay)
                                                      (+ (* bx (polyomino-degree polyomino))
                                                         by))))))))))


  (let* ((a (make-coordinate))
         (b (up a))
         (c (up b))
         (d (left b))
         (p (make-polyomino :active-coordinates (list a b c d))))
    (polyomino-to-string (polyomino-normalize p)))
#+end_src

#+RESULTS:
: -X--
: XX--
: -X--
: ----

Of course, this just lets me see it as a person.  I need to somehow
teach the computer that these would be the same.  Luckily, rotation is
not that tough.  And then I'd just have to compare successive rotations
to a collection to know if I had seen it.

#+begin_src lisp :exports both 
  (defun polyomino-rotate (polyomino)
    (let ((d (- (polyomino-degree polyomino) 1)))
      (polyomino-normalize 
       (make-polyomino :active-coordinates 
                       (with-slots (active-coordinates) polyomino
                         (loop for coordinate in active-coordinates
                            collect (with-slots (x y) coordinate
                                      (make-coordinate :x y :y (- d x)))))))))

  (let* ((a (make-coordinate))
         (b (up a))
         (c (up b))
         (d (left b))
         (p (make-polyomino :active-coordinates (list a b c d))))
    (format nil "狺播" 
            (list 
             (polyomino-to-string (polyomino-normalize p))
             (polyomino-to-string (polyomino-rotate p))
             (polyomino-to-string (polyomino-rotate (polyomino-rotate p)))
             (polyomino-to-string (polyomino-rotate (polyomino-rotate (polyomino-rotate p)))))))
#+end_src

#+RESULTS:
#+begin_example
-X--
XX--
-X--
----

-X--
XXX-
----
----

X---
XX--
X---
----

XXX-
-X--
----
----

#+end_example

And just to see what that looks like with a domino.

#+begin_src lisp :exports both
  (let* ((a (make-coordinate))
         (b (up a))
         (p (make-polyomino :active-coordinates (list a b))))
    (format nil "狺拨" 
            (list 
             (polyomino-to-string (polyomino-normalize p))
             (polyomino-to-string (polyomino-rotate p))
             (polyomino-to-string (polyomino-rotate (polyomino-rotate p)))
             (polyomino-to-string (polyomino-rotate (polyomino-rotate (polyomino-rotate p)))))))

#+end_src

#+RESULTS:
#+begin_example
X-
X-

XX
--

X-
X-

XX
--

#+end_example

