generating-polyominos.html

<div id="outline-container-orgc5f015e" class="outline-2">
<h2 id="orgc5f015e">But I really want a polyomino representation.</h2>
<div class="outline-text-2" id="text-orgc5f015e">
<p>
Basic structure for a polyomino isn't that tough, just a list of
coordinates.  I just need a helper method to make sure and only add
unique coordinates to one.  (I don't have a sanity check to make sure
it is a legal coordinate to add, though I don't think that would be
tough here.)
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defstruct</span> <span style="color: #2492db;">polyomino</span> (active-coordinates nil <span style="color: #16a085;">:read-only</span> t))

(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-degree</span> (polyomino)
  (length (slot-value polyomino 'active-coordinates)))

(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-add-coordinate</span> (polyomino coordinate)
  (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (adjoin coordinate (slot-value polyomino 'active-coordinates) <span style="color: #16a085;">:test</span> #'equalp)))

(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-has-coordinate</span> (polyomino coordinate)
  (member coordinate (slot-value polyomino 'active-coordinates) <span style="color: #16a085;">:test</span> #'equalp))
</pre>
</div>

<p>
Of course, just printing an instance of this is not that helpful.  Not
worthless, since you can see the coordinates in a polyomino; just not
entirely helpful.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">let*</span> ((a (make-polyomino))
       (b (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list (make-coordinate))))
       (c (polyomino-add-coordinate a (make-coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0)))
       (d (polyomino-add-coordinate c (make-coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0)))
       (e (polyomino-add-coordinate d (make-coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 1))))
  (list a b c d e))
</pre>
</div>

<pre class="example">
(#S(POLYOMINO :ACTIVE-COORDINATES NIL)
 #S(POLYOMINO :ACTIVE-COORDINATES (#S(COORDINATE :X 0 :Y 0)))
 #S(POLYOMINO :ACTIVE-COORDINATES (#S(COORDINATE :X 0 :Y 0)))
 #S(POLYOMINO :ACTIVE-COORDINATES (#S(COORDINATE :X 0 :Y 0)))
 #S(POLYOMINO
    :ACTIVE-COORDINATES (#S(COORDINATE :X 0 :Y 1) #S(COORDINATE :X 0 :Y 0))))
</pre>


<p>
That said, lets make something that will do that for us.  My FORMAT
skills are less than worth talking about, but it turns out this isn't
that tough.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-to-string</span> (polyomino)
  (<span style="color: #d98c10;">let</span> ((width (polyomino-degree polyomino))
        (height (polyomino-degree polyomino)))
    (format nil <span style="color: #0a74b9;">"犴鸹狺"</span>
            (<span style="color: #d98c10;">loop</span> for i from 0 below height
               collect (<span style="color: #d98c10;">loop</span> for j from 0 below width
                          collect (<span style="color: #d98c10;">if</span> (polyomino-has-coordinate polyomino (make-coordinate <span style="color: #16a085;">:x</span> i <span style="color: #16a085;">:y</span> j))
                                      <span style="color: #0a74b9;">"X"</span>
                                      <span style="color: #0a74b9;">"-"</span>))))))

(<span style="color: #d98c10;">let*</span> ((a (make-coordinate))
       (b (down a))
       (c (down b))
       (d (right b))
       (p (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list a b c d))))
  (polyomino-to-string p))
</pre>
</div>

<pre class="example">
X---
XX--
X---
----
</pre>


<p>
That looks almost like what I want.  Printing about 4 spaces by 4
spaces and letting me see things.  However, it has an obvious flaw,
demonstrated by:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">let*</span> ((a (make-coordinate))
       (b (up a))
       (c (up b))
       (d (left b))
       (p (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list a b c d))))
  (polyomino-to-string p))
</pre>
</div>

<pre class="example">
X---
----
----
----
</pre>


<p>
This would also prevent me from seeing that two identical shapes were
identical, which is annoying.  Luckily, not tough.  Just need to
normalize us to the origin.  (This was fun to work out on paper.)
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-normalize</span> (polyomino)
  (<span style="color: #d98c10;">loop</span> for coordinate in (slot-value polyomino 'active-coordinates)
     minimizing (slot-value coordinate 'x) into min-x
     minimizing (slot-value coordinate 'y) into min-y
     finally (<span style="color: #d98c10;">return</span> (make-polyomino <span style="color: #16a085;">:active-coordinates</span>
                                     (sort (<span style="color: #d98c10;">loop</span> for coordinate in (slot-value polyomino 'active-coordinates)
                                              collect (<span style="color: #d98c10;">with-slots</span> (x y) coordinate
                                                        (make-coordinate <span style="color: #16a085;">:x</span> (- x min-x)
                                                                         <span style="color: #16a085;">:y</span> (- y min-y))))
                                           (<span style="color: #d98c10;">lambda</span> (a b)
                                             (<span style="color: #d98c10;">with-slots</span> ((ax x) (ay y)) a
                                               (<span style="color: #d98c10;">with-slots</span> ((bx x) (by y)) b
                                                 (&lt; (+ (* ax (polyomino-degree polyomino))
                                                       ay)
                                                    (+ (* bx (polyomino-degree polyomino))
                                                       by))))))))))


(<span style="color: #d98c10;">let*</span> ((a (make-coordinate))
       (b (up a))
       (c (up b))
       (d (left b))
       (p (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list a b c d))))
  (polyomino-to-string (polyomino-normalize p)))
</pre>
</div>

<pre class="example">
-X--
XX--
-X--
----
</pre>


<p>
Of course, this just lets me see it as a person.  I need to somehow
teach the computer that these would be the same.  Luckily, rotation is
not that tough.  And then I'd just have to compare successive rotations
to a collection to know if I had seen it.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-rotate</span> (polyomino)
  (<span style="color: #d98c10;">let</span> ((d (- (polyomino-degree polyomino) 1)))
    (polyomino-normalize 
     (make-polyomino <span style="color: #16a085;">:active-coordinates</span> 
                     (<span style="color: #d98c10;">with-slots</span> (active-coordinates) polyomino
                       (<span style="color: #d98c10;">loop</span> for coordinate in active-coordinates
                          collect (<span style="color: #d98c10;">with-slots</span> (x y) coordinate
                                    (make-coordinate <span style="color: #16a085;">:x</span> y <span style="color: #16a085;">:y</span> (- d x)))))))))

(<span style="color: #d98c10;">let*</span> ((a (make-coordinate))
       (b (up a))
       (c (up b))
       (d (left b))
       (p (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list a b c d))))
  (format nil <span style="color: #0a74b9;">"狺播"</span> 
          (list 
           (polyomino-to-string (polyomino-normalize p))
           (polyomino-to-string (polyomino-rotate p))
           (polyomino-to-string (polyomino-rotate (polyomino-rotate p)))
           (polyomino-to-string (polyomino-rotate (polyomino-rotate (polyomino-rotate p)))))))
</pre>
</div>

<pre class="example">
-X--
XX--
-X--
----

-X--
XXX-
----
----

X---
XX--
X---
----

XXX-
-X--
----
----

</pre>

<p>
And just to see what that looks like with a domino.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">let*</span> ((a (make-coordinate))
       (b (up a))
       (p (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list a b))))
  (format nil <span style="color: #0a74b9;">"狺拨犴鸹"</span> 
          (list 
           (polyomino-to-string (polyomino-normalize p))
           (polyomino-to-string (polyomino-rotate p))
           (polyomino-to-string (polyomino-rotate (polyomino-rotate p)))
           (polyomino-to-string (polyomino-rotate (polyomino-rotate (polyomino-rotate p)))))))

</pre>
</div>

<pre class="example">
X-
X-

XX
--

X-
X-

XX
--

</pre>
</div>
</div>
