generating-polyominos.org
* Now, let's generate some polyominos.

The algorithm I'm going for is ridiculously brute force.  We'll start
with a function that will grow from a list of seed polyominos into the
set of all polyominos that can be grown from them.

#+begin_src lisp
  (defun polyomino-grow-list (seeds)
    (let ((grown-values nil))
      (dolist (polyomino seeds)
        (let ((polyomino-coordinates (slot-value polyomino 'active-coordinates))
              (candidates nil))
          (dolist (c polyomino-coordinates)
            (progn
              (unless (member (up c) polyomino-coordinates :test #'equalp)
                (setf candidates (adjoin (up c) candidates :test #'equalp)))
              (unless (member (right c) polyomino-coordinates :test #'equalp)
                (setf candidates (adjoin (right c) candidates :test #'equalp)))
              (unless (member (down c) polyomino-coordinates :test #'equalp)
                (setf candidates (adjoin (down c) candidates :test #'equalp)))
              (unless (member (left c) polyomino-coordinates :test #'equalp)
                (setf candidates (adjoin (left c) candidates :test #'equalp)))))
          (dolist (c candidates)
            (let ((p (polyomino-normalize (polyomino-add-coordinate polyomino c))))
              (unless (or
                       (member p grown-values :test #'equalp)
                       (member (polyomino-rotate p) grown-values :test #'equalp)
                       (member (polyomino-rotate (polyomino-rotate p)) grown-values :test #'equalp)
                       (member (polyomino-rotate (polyomino-rotate (polyomino-rotate p))) grown-values :test #'equalp))
                (setf grown-values (cons p grown-values)))))))
      grown-values))
#+end_src

#+RESULTS:
: POLYOMINO-GROW-LIST

And, well, did it work?  Luckily, it is pretty fast[fn:1] for up to
degree 9.  So, checking expected values on the [[https://en.wikipedia.org/wiki/Polyomino][Polyomino]] wikipedia
page, I see that I agree with what they have.  Yay!

#+begin_src lisp :exports both
  (let* ((a (list (make-polyomino :active-coordinates (list (make-coordinate)))))
         (b (polyomino-grow-list a))
         (c (polyomino-grow-list b))
         (d (polyomino-grow-list c))
         (e (polyomino-grow-list d))
         (f (polyomino-grow-list e))
         (g (polyomino-grow-list f))
         (h (polyomino-grow-list g))
         (i (polyomino-grow-list h)))
    (mapcar #'length (list a b c d e f g h i)))
#+end_src

#+RESULTS:
| 1 | 1 | 2 | 7 | 18 | 60 | 196 | 704 | 2500 |

I'll note that it did start to slog predictably around degree 10.  I
knew this would be not only a crappy algorithm, but almost certainly
poorly implemented.  :(

* A brief diversion

Before we get to what I actually need, it isn't too late for me to
waste some more time.  Which we will waste by visually spot checking
some polyominos that most folks recognize.

#+begin_src lisp :exports both
  (let* ((monimo (make-polyomino :active-coordinates (list (make-coordinate :x 0 :y 0))))
         (dominos (polyomino-grow-list (list monimo)))
         (trominos (polyomino-grow-list dominos))
         (tetrominos (polyomino-grow-list trominos)))
    (format nil "狺" (mapcar #'polyomino-to-string tetrominos)))
#+end_src

#+RESULTS:
#+begin_example
X---
XX--
-X--
----

XX--
XX--
----
----

XX--
-XX-
----
----

XXX-
-X--
----
----

--X-
XXX-
----
----

XXXX
----
----
----

XXX-
--X-
----
----

#+end_example

* Of course, I really need something else.

Because of course I do.  Specifically, I need something I can feed
into one of Knuth's DLX implementations to get how many ways a
particular polyomino will tile a grid.  Luckily that is not hard at
all.  Just hella verbose, such that I will not be putting any of it on
this page.  I will have the code, though.

What does that input look like?  Roughly described as a row of column
names followed by rows of active columns.

* Generating the header row

This is ridiculously straight forward. 

#+begin_src lisp :exports both
  (defun polyomino-dlx-headers (board-size)
    (format nil "隐崦狺" (loop for i from 0 below board-size
       append (loop for j from 0 below board-size
                   collect (list i j)))))

  (polyomino-dlx-headers 4)
#+end_src

#+RESULTS:
: R0C0 R0C1 R0C2 R0C3 R1C0 R1C1 R1C2 R1C3 R2C0 R2C1 R2C2 R2C3 R3C0 R3C1 R3C2 R3C3 

