generating-polyominos.html

<div id="outline-container-org0888cb0" class="outline-2">
<h2 id="org0888cb0">Now, let's generate some polyominos.</h2>
<div class="outline-text-2" id="text-org0888cb0">
<p>
The algorithm I'm going for is ridiculously brute force.  We'll start
with a function that will grow from a list of seed polyominos into the
set of all polyominos that can be grown from them.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-grow-list</span> (seeds)
  (<span style="color: #d98c10;">let</span> ((grown-values nil))
    (<span style="color: #d98c10;">dolist</span> (polyomino seeds)
      (<span style="color: #d98c10;">let</span> ((polyomino-coordinates (slot-value polyomino 'active-coordinates))
            (candidates nil))
        (<span style="color: #d98c10;">dolist</span> (c polyomino-coordinates)
          (<span style="color: #d98c10;">progn</span>
            (<span style="color: #d98c10;">unless</span> (member (up c) polyomino-coordinates <span style="color: #16a085;">:test</span> #'equalp)
              (setf candidates (adjoin (up c) candidates <span style="color: #16a085;">:test</span> #'equalp)))
            (<span style="color: #d98c10;">unless</span> (member (right c) polyomino-coordinates <span style="color: #16a085;">:test</span> #'equalp)
              (setf candidates (adjoin (right c) candidates <span style="color: #16a085;">:test</span> #'equalp)))
            (<span style="color: #d98c10;">unless</span> (member (down c) polyomino-coordinates <span style="color: #16a085;">:test</span> #'equalp)
              (setf candidates (adjoin (down c) candidates <span style="color: #16a085;">:test</span> #'equalp)))
            (<span style="color: #d98c10;">unless</span> (member (left c) polyomino-coordinates <span style="color: #16a085;">:test</span> #'equalp)
              (setf candidates (adjoin (left c) candidates <span style="color: #16a085;">:test</span> #'equalp)))))
        (<span style="color: #d98c10;">dolist</span> (c candidates)
          (<span style="color: #d98c10;">let</span> ((p (polyomino-normalize (polyomino-add-coordinate polyomino c))))
            (<span style="color: #d98c10;">unless</span> (or
                     (member p grown-values <span style="color: #16a085;">:test</span> #'equalp)
                     (member (polyomino-rotate p) grown-values <span style="color: #16a085;">:test</span> #'equalp)
                     (member (polyomino-rotate (polyomino-rotate p)) grown-values <span style="color: #16a085;">:test</span> #'equalp)
                     (member (polyomino-rotate (polyomino-rotate (polyomino-rotate p))) grown-values <span style="color: #16a085;">:test</span> #'equalp))
              (setf grown-values (cons p grown-values)))))))
    grown-values))
</pre>
</div>

<p>
And, well, did it work?  Luckily, it is pretty fast<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> for up to
degree 9.  So, checking expected values on the <a href="https://en.wikipedia.org/wiki/Polyomino">Polyomino</a> wikipedia
page, I see that I agree with what they have.  Yay!
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">let*</span> ((a (list (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list (make-coordinate)))))
       (b (polyomino-grow-list a))
       (c (polyomino-grow-list b))
       (d (polyomino-grow-list c))
       (e (polyomino-grow-list d))
       (f (polyomino-grow-list e))
       (g (polyomino-grow-list f))
       (h (polyomino-grow-list g))
       (i (polyomino-grow-list h)))
  (mapcar #'length (list a b c d e f g h i)))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">7</td>
<td class="org-right">18</td>
<td class="org-right">60</td>
<td class="org-right">196</td>
<td class="org-right">704</td>
<td class="org-right">2500</td>
</tr>
</tbody>
</table>

<p>
I'll note that it did start to slog predictably around degree 10.  I
knew this would be not only a crappy algorithm, but almost certainly
poorly implemented.  :(
</p>
</div>
</div>

<div id="outline-container-orgd6fa03e" class="outline-2">
<h2 id="orgd6fa03e">A brief diversion</h2>
<div class="outline-text-2" id="text-orgd6fa03e">
<p>
Before we get to what I actually need, it isn't too late for me to
waste some more time.  Which we will waste by visually spot checking
some polyominos that most folks recognize.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">let*</span> ((monimo (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list (make-coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0))))
       (dominos (polyomino-grow-list (list monimo)))
       (trominos (polyomino-grow-list dominos))
       (tetrominos (polyomino-grow-list trominos)))
  (format nil <span style="color: #0a74b9;">"犴鸹狺"</span> (mapcar #'polyomino-to-string tetrominos)))
</pre>
</div>

<pre class="example">
X---
XX--
-X--
----

XX--
XX--
----
----

XX--
-XX-
----
----

XXX-
-X--
----
----

--X-
XXX-
----
----

XXXX
----
----
----

XXX-
--X-
----
----

</pre>
</div>
</div>

<div id="outline-container-orgd2adcc3" class="outline-2">
<h2 id="orgd2adcc3">Of course, I really need something else.</h2>
<div class="outline-text-2" id="text-orgd2adcc3">
<p>
Because of course I do.  Specifically, I need something I can feed
into one of Knuth's DLX implementations to get how many ways a
particular polyomino will tile a grid.  Luckily that is not hard at
all.  Just hella verbose, such that I will not be putting any of it on
this page.  I will have the code, though.
</p>

<p>
What does that input look like?  Roughly described as a row of column
names followed by rows of active columns.
</p>
</div>
</div>

<div id="outline-container-org7118b57" class="outline-2">
<h2 id="org7118b57">Generating the header row</h2>
<div class="outline-text-2" id="text-org7118b57">
<p>
This is ridiculously straight forward. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-dlx-headers</span> (board-size)
  (format nil <span style="color: #0a74b9;">"隐崦狺"</span> (<span style="color: #d98c10;">loop</span> for i from 0 below board-size
     append (<span style="color: #d98c10;">loop</span> for j from 0 below board-size
                 collect (list i j)))))

(polyomino-dlx-headers 4)
</pre>
</div>

<pre class="example">
R0C0 R0C1 R0C2 R0C3 R1C0 R1C1 R1C2 R1C3 R2C0 R2C1 R2C2 R2C3 R3C0 R3C1 R3C2 R3C3 
</pre>
</div>
</div>
