generating-polyominos.org
* Generating a placement of a piece everywhere it fits

Placing the polyomino is relatively straight forward.  Just get all
unique rotations of the one I'm placing, and then loop over the
coordinates as long as they fit on the board outputting what is
covered.

We'll start with a function to get all unique rotations.  And, because
I'm not wasting paper, we'll look at familiar rotations of the
tetrominos.  Yes, this is in part for me to make sure it worked. :)

#+begin_src lisp :exports both
    (defun polyomino-unique-rotations (p)
      (let* ((a (polyomino-rotate p))
             (b (polyomino-rotate a))
             (c (polyomino-rotate b))
             (l (list p))
             (l (adjoin a l :test #'equalp))
             (l (adjoin b l :test #'equalp))
             (l (adjoin c l :test #'equalp)))
        l))

    (let* ((monimo (make-polyomino :active-coordinates (list (make-coordinate :x 0 :y 0))))
           (dominos (polyomino-grow-list (list monimo)))
           (trominos (polyomino-grow-list dominos))
           (tetrominos (polyomino-grow-list trominos))
           (unique-rotations (loop for polyomino in tetrominos ;;I feel like there should be an fmap?
                                  append (loop for rotation in (polyomino-unique-rotations polyomino)
                                              collect rotation))))
      (format nil "狺" (mapcar #'polyomino-to-string unique-rotations)))

#+end_src

#+RESULTS:
#+begin_example
-XX-
XX--
----
----

X---
XX--
-X--
----

XX--
XX--
----
----

-X--
XX--
X---
----

XX--
-XX-
----
----

X---
XX--
X---
----

-X--
XXX-
----
----

-X--
XX--
-X--
----

XXX-
-X--
----
----

XX--
-X--
-X--
----

XXX-
X---
----
----

X---
X---
XX--
----

--X-
XXX-
----
----

X---
X---
X---
X---

XXXX
----
----
----

XX--
X---
X---
----

X---
XXX-
----
----

-X--
-X--
XX--
----

XXX-
--X-
----
----

#+end_example

From there, we have a function that will loop over what we just
produced and keep placing it on the board.  

#+begin_src lisp 
  (defun polyomino-dlx-generate-row (p board-size)
    (format nil "隐崦}%}"
            (loop for c in (slot-value p 'active-coordinates)
               maximizing (slot-value c 'x) into max-x
               maximizing (slot-value c 'y) into max-y
               finally (return (loop for i from 0 below (- board-size max-x)
                                  append (loop for j from 0 below (- board-size max-y)
                                            collect (loop for c in (slot-value p 'active-coordinates)
                                                       collect (with-slots (x y) c
                                                                 (list (+ x i) (+ y j))))))))))
#+end_src

#+RESULTS:
: POLYOMINO-DLX-GENERATE-ROW

And just confirming there are 12 ways to place a non-rotating domino
on a $4\times4$ board.

#+begin_src lisp :exports both 
  (let* ((monimo (make-polyomino :active-coordinates (list (make-coordinate :x 0 :y 0))))
         (dominos (polyomino-grow-list (list monimo))))
    (polyomino-dlx-generate-row (elt dominos 0) 4))
#+end_src

#+RESULTS:
#+begin_example
R0C0 R0C1 
R0C1 R0C2 
R0C2 R0C3 
R1C0 R1C1 
R1C1 R1C2 
R1C2 R1C3 
R2C0 R2C1 
R2C1 R2C2 
R2C2 R2C3 
R3C0 R3C1 
R3C1 R3C2 
R3C2 R3C3 
#+end_example

* Bringing them together

#+begin_src lisp
  (defun polyomino-dlx-generate (fileprefix degree board-size)
    (let ((polyominos (list (make-polyomino :active-coordinates (list (make-coordinate :x 0 :y 0))))))
      (dotimes (i (- degree 1))
        (setf polyominos (polyomino-grow-list polyominos)))

      (dotimes (i (length polyominos))
        (with-open-file (stream (format nil "a-a-a.dlx" fileprefix degree i) 
                                :direction :output
                                :if-exists :supersede
                                :if-does-not-exist :create)
          (format stream "a&" (polyomino-dlx-headers board-size))
          (dolist (rotation (polyomino-unique-rotations (elt polyominos i)))
            (format stream "a&" (polyomino-dlx-generate-row rotation board-size)))))))

  (polyomino-dlx-generate "testing" 8 16)
#+end_src

#+RESULTS:
: NIL

From this point, I simply piped each file into a compiled version of
Knuth's DLX1.  Took about a minute to find how many ways to tile a
$16\times16$ board with all "one-sided" polyominos.  Which, when I saw
my answer disagreed with the colleague, I saw he was looking at just
the 369 free octominos, whereas I looked at the 704 one-sided ones.
Oops.

I'll try and get the time to change this write up to account for that.
We're going camping, though, so I that takes precedence.  (This is
also why I have not found a way to show the output from running the
DLX algorithm directly.)

* Afterward

This is officially the first program I've written in Common Lisp.  I
have found it fun.  Though, it is amusing how long it took something I
wrote on paper in a java like language, to this.

I'm hopeful to stick with it.  The tooling is fun.

* Footnotes

[fn:1] Where pretty fast means running it with (time) gives.  Not
record breaking, but good enough for what I'm doing.

#+begin_example
Evaluation took:
  2.136 seconds of real time
  2.136099 seconds of total run time (2.124089 user, 0.012010 system)
  [ Run times consist of 0.006 seconds GC time, and 2.131 seconds non-GC time. ]
  100.00% CPU
  5,323,001,318 processor cycles
  44,098,208 bytes consed
#+end_example
