generating-polyominos.html

<div id="outline-container-orge1fa39b" class="outline-2">
<h2 id="orge1fa39b">Generating a placement of a piece everywhere it fits</h2>
<div class="outline-text-2" id="text-orge1fa39b">
<p>
Placing the polyomino is relatively straight forward.  Just get all
unique rotations of the one I'm placing, and then loop over the
coordinates as long as they fit on the board outputting what is
covered.
</p>

<p>
We'll start with a function to get all unique rotations.  And, because
I'm not wasting paper, we'll look at familiar rotations of the
tetrominos.  Yes, this is in part for me to make sure it worked. :)
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-unique-rotations</span> (p)
  (<span style="color: #d98c10;">let*</span> ((a (polyomino-rotate p))
         (b (polyomino-rotate a))
         (c (polyomino-rotate b))
         (l (list p))
         (l (adjoin a l <span style="color: #16a085;">:test</span> #'equalp))
         (l (adjoin b l <span style="color: #16a085;">:test</span> #'equalp))
         (l (adjoin c l <span style="color: #16a085;">:test</span> #'equalp)))
    l))

(<span style="color: #d98c10;">let*</span> ((monimo (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list (make-coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0))))
       (dominos (polyomino-grow-list (list monimo)))
       (trominos (polyomino-grow-list dominos))
       (tetrominos (polyomino-grow-list trominos))
       (unique-rotations (<span style="color: #d98c10;">loop</span> for polyomino in tetrominos <span style="color: #95a5a6;">;;</span><span style="color: #7f8c8d;">I feel like there should be an fmap?</span>
                              append (<span style="color: #d98c10;">loop</span> for rotation in (polyomino-unique-rotations polyomino)
                                          collect rotation))))
  (format nil <span style="color: #0a74b9;">"犴鸹狺"</span> (mapcar #'polyomino-to-string unique-rotations)))

</pre>
</div>

<pre class="example">
-XX-
XX--
----
----

X---
XX--
-X--
----

XX--
XX--
----
----

-X--
XX--
X---
----

XX--
-XX-
----
----

X---
XX--
X---
----

-X--
XXX-
----
----

-X--
XX--
-X--
----

XXX-
-X--
----
----

XX--
-X--
-X--
----

XXX-
X---
----
----

X---
X---
XX--
----

--X-
XXX-
----
----

X---
X---
X---
X---

XXXX
----
----
----

XX--
X---
X---
----

X---
XXX-
----
----

-X--
-X--
XX--
----

XXX-
--X-
----
----

</pre>

<p>
From there, we have a function that will loop over what we just
produced and keep placing it on the board.  
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-dlx-generate-row</span> (p board-size)
  (format nil <span style="color: #0a74b9;">"隐崦}%}"</span>
          (<span style="color: #d98c10;">loop</span> for c in (slot-value p 'active-coordinates)
             maximizing (slot-value c 'x) into max-x
             maximizing (slot-value c 'y) into max-y
             finally (<span style="color: #d98c10;">return</span> (<span style="color: #d98c10;">loop</span> for i from 0 below (- board-size max-x)
                                append (<span style="color: #d98c10;">loop</span> for j from 0 below (- board-size max-y)
                                          collect (<span style="color: #d98c10;">loop</span> for c in (slot-value p 'active-coordinates)
                                                     collect (<span style="color: #d98c10;">with-slots</span> (x y) c
                                                               (list (+ x i) (+ y j))))))))))
</pre>
</div>

<p>
And just confirming there are 12 ways to place a non-rotating domino
on a \(4\times4\) board.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">let*</span> ((monimo (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list (make-coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0))))
       (dominos (polyomino-grow-list (list monimo))))
  (polyomino-dlx-generate-row (elt dominos 0) 4))
</pre>
</div>

<pre class="example">
R0C0 R0C1 
R0C1 R0C2 
R0C2 R0C3 
R1C0 R1C1 
R1C1 R1C2 
R1C2 R1C3 
R2C0 R2C1 
R2C1 R2C2 
R2C2 R2C3 
R3C0 R3C1 
R3C1 R3C2 
R3C2 R3C3 
</pre>
</div>
</div>

<div id="outline-container-org7272614" class="outline-2">
<h2 id="org7272614">Bringing them together</h2>
<div class="outline-text-2" id="text-org7272614">
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #d98c10;">defun</span> <span style="color: #34495e; font-weight: bold;">polyomino-dlx-generate</span> (fileprefix degree board-size)
  (<span style="color: #d98c10;">let</span> ((polyominos (list (make-polyomino <span style="color: #16a085;">:active-coordinates</span> (list (make-coordinate <span style="color: #16a085;">:x</span> 0 <span style="color: #16a085;">:y</span> 0))))))
    (<span style="color: #d98c10;">dotimes</span> (i (- degree 1))
      (setf polyominos (polyomino-grow-list polyominos)))

    (<span style="color: #d98c10;">dotimes</span> (i (length polyominos))
      (<span style="color: #d98c10;">with-open-file</span> (stream (format nil <span style="color: #0a74b9;">"a-a-a.dlx"</span> fileprefix degree i) 
                              <span style="color: #16a085;">:direction</span> <span style="color: #16a085;">:output</span>
                              <span style="color: #16a085;">:if-exists</span> <span style="color: #16a085;">:supersede</span>
                              <span style="color: #16a085;">:if-does-not-exist</span> <span style="color: #16a085;">:create</span>)
        (format stream <span style="color: #0a74b9;">"a&amp;"</span> (polyomino-dlx-headers board-size))
        (<span style="color: #d98c10;">dolist</span> (rotation (polyomino-unique-rotations (elt polyominos i)))
          (format stream <span style="color: #0a74b9;">"a&amp;"</span> (polyomino-dlx-generate-row rotation board-size)))))))

(polyomino-dlx-generate <span style="color: #0a74b9;">"testing"</span> 8 16)
</pre>
</div>

<p>
From this point, I simply piped each file into a compiled version of
Knuth's DLX1.  Took about a minute to find how many ways to tile a
\(16\times16\) board with all "one-sided" polyominos.  Which, when I saw
my answer disagreed with the colleague, I saw he was looking at just
the 369 free octominos, whereas I looked at the 704 one-sided ones.
Oops.
</p>

<p>
I'll try and get the time to change this write up to account for that.
We're going camping, though, so I that takes precedence.  (This is
also why I have not found a way to show the output from running the
DLX algorithm directly.)
</p>
</div>
</div>

<div id="outline-container-org3e496f8" class="outline-2">
<h2 id="org3e496f8">Afterward</h2>
<div class="outline-text-2" id="text-org3e496f8">
<p>
This is officially the first program I've written in Common Lisp.  I
have found it fun.  Though, it is amusing how long it took something I
wrote on paper in a java like language, to this.
</p>

<p>
I'm hopeful to stick with it.  The tooling is fun.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Where pretty fast means running it with (time) gives.  Not
record breaking, but good enough for what I'm doing.
</p>

<pre class="example">
Evaluation took:
  2.136 seconds of real time
  2.136099 seconds of total run time (2.124089 user, 0.012010 system)
  [ Run times consist of 0.006 seconds GC time, and 2.131 seconds non-GC time. ]
  100.00% CPU
  5,323,001,318 processor cycles
  44,098,208 bytes consed
</pre></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Josh Berry</p>
<p class="date">Created: 2019-07-05 Fri 20:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
